In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [11]:
# Define column names
columns_names = ['user_id', 'item_id', 'rating', 'timestamp']

# Read the data from the file 'u.data'
data_01 = pd.read_csv(
    'u.data',  # File path
    sep='\t',  # Separator (tab-separated file)
    names=columns_names  # Column names
)

data_01.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [13]:
movies_titles = pd.read_csv('Movie_Id_Titles')

In [17]:
data_02 = pd.merge(data_01, movies_titles, on = 'item_id')

data_02.head()

   user_id  item_id  rating  timestamp                            title
0        0       50       5  881250949                 Star Wars (1977)
1        0      172       5  881250949  Empire Strikes Back, The (1980)
2        0      133       1  881250949        Gone with the Wind (1939)
3      196      242       3  881250949                     Kolya (1996)
4      186      302       3  891717742         L.A. Confidential (1997)